[
    {
        "name": "Физика",
        "fact": "Свету нужно 8 минут 20 секунд, чтобы долететь от Солнца до Земли, но внутри Солнца фотон может блуждать тысячи лет, прежде чем вырвется наружу."
    },
    {
        "name": "Физика",
        "fact": "Жидкость может течь вверх – благодаря капиллярному эффекту (например, вода поднимается по тонким трубкам растений)."
    },
    {
        "name": "Химия",
        "fact": "Мёд никогда не портится – археологи находили съедобный мёд в древнеегипетских гробницах возрастом 3000 лет."
    },
    {
        "name": "Химия",
        "fact": "Галлий – металл, который плавится в руке (температура плавления всего 29.76°C)."
    },
    {
        "name": "Биология",
        "fact": "У осьминога три сердца, и когда он плывёт, одно из них останавливается."
    },
    {
        "name": "Биология",
        "fact": "ДНК человека на 50% совпадает с ДНК банана."
    },
    {
        "name": "Астрономия",
        "fact": "На Венере сутки длиннее года – один оборот вокруг Солнца (год) занимает 225 земных дней, а оборот вокруг оси (сутки) – 243 дня."
    },
    {
        "name": "Астрономия",
        "fact": "Сатурн настолько лёгкий, что если бы его поместили в гигантский океан, он бы плавал на поверхности."
    },
    {
        "name": "Геология",
        "fact": "Земля не идеально круглая – она слегка сплюснута у полюсов и расширена у экватора из-за вращения."
    },
    {
        "name": "Геология",
        "fact": "В Алмазах могут быть алмазы – некоторые кристаллы содержат внутри ещё более древние алмазы."
    },
    {
        "name": "Математика",
        "fact": "Число Пи вычислено до 100 триллионов знаков, но в реальных расчётах хватает и 40."
    },
    {
        "name": "Математика",
        "fact": "Шанс собрать кубик Рубика наугад – 1 к 43 252 003 274 489 856 000."
    },
    {
        "name": "Медицина",
        "fact": "Желудочная кислота может растворить бритвенное лезвие – её pH составляет 1.5–3.5."
    },
    {
        "name": "Медицина",
        "fact": "Человек может прожить без воды всего 3–5 дней, но без еды – до 70 дней (рекорд – 382 дня)."
    },
    {
        "name": "Психология",
        "fact": "Человек забывает 50% новой информации уже через час, если не повторяет её."
    },
    {
        "name": "Психология",
        "fact": "Смех заразителен – это эволюционный механизм социального взаимодействия."
    },
    {
        "name": "Технологии",
        "fact": "Первый компьютерный вирус (1982) заражал дискеты Apple II и назывался Elk Cloner."
    },
    {
        "name": "Технологии",
        "fact": "QR-код может хранить до 2953 байт – этого хватит для небольшого рассказа."
    },
    {
        "name": "Лингвистика",
        "fact": "Слово \"робот\" придумал чешский писатель Карел Чапек в пьесе R.U.R. (1920)."
    },
    {
        "name": "Лингвистика",
        "fact": "В языке пирахан (Амазония) нет чисел – там только понятия \"мало\" и \"много\"."
    }
]